school-app/app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
    def index
        teachers = Teacher.all

INSERT INTO "teachers" ("name", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dan"], ["photo", "blah balh"], ["created_at", "2019-07-01 18:36:40.079431"], ["updated_at", "2019-07-01 18:36:40.079431"]]
---
    def create
        teacher =  Teacher.new teacher_params

        if teacher.save

UPDATE "teachers" SET "name" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["name", "dan2"], ["updated_at", "2019-07-01 18:37:28.735700"], ["id", 7]]
---
    def update
        if @teacher.update(teacher_params)

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 7]]
---
    def destroy
        @teacher.destroy